<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"ff000b399975985f7ad7bd26184306f22db1d811ca4ce9ead230e1e59a12aea6","plan_job_ref":"Job Create terraform plan for Palo Alto Panorama Add-on #31 at https://github.com/AFMPE/mpe_palo_alto/actions/runs/7835193544","plan_hash":"0d6667b9da96b4e91ca5db8e47044c80272807b6a16e44171cbafb967859919d","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh9df3erta
container_name=paloalto            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
jumpbox_vm_admin_password         = (sensitive value)
panorama_vm_admin_ssh_private_key = (sensitive value)
panorama_vm_admin_ssh_public_key  = (sensitive value)
production_subscription_id        = (sensitive value)
spoke_subscription_id             = (sensitive value)
```
</details>
<details>
<summary>Plan: 10 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_key_vault_secret.panorama-server-ssh-key will be created
  + resource "azurerm_key_vault_secret" "panorama-server-ssh-key" {
      + id                      = (known after apply)
      + key_vault_id            = "*********************************************************************************************************************************************************"
      + name                    = "Panorama-Server-SSH-Key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_network_security_group.jumpbox_vm_nsg will be created
  + resource "azurerm_network_security_group" "jumpbox_vm_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "ampe-eus-panorama-jumpbox-prod-jumpbox-nsg"
      + resource_group_name = "ampe-eus-id-prod-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "environment" = "Production"
        }
    }

  # azurerm_network_security_group.panorama_vm_nsg will be created
  + resource "azurerm_network_security_group" "panorama_vm_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "ampe-eus-panorama-prod-nsg"
      + resource_group_name = "ampe-eus-id-prod-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = "Allow HTTPS access to Panorama VM"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "https"
              + priority                                   = 300
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Allow RDP access to Panorama VM"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3386"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "rdp"
              + priority                                   = 200
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Allow SSH access to Panorama VM"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "ssh"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Allow firewall access to Panorama VM"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "28443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "panorama_firewall"
              + priority                                   = 500
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Allow log access to Panorama VM"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3978"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "panorama_log"
              + priority                                   = 400
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "Production"
        }
    }

  # module.mod_jumpbox_virtual_machine.data.azurenoopsutils_resource_name.avset will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "avset" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama-jmpbox"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_availability_set"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_jumpbox_virtual_machine.data.azurenoopsutils_resource_name.computer_windows will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "computer_windows" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "bc274832b6"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_windows_virtual_machine"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_jumpbox_virtual_machine.data.azurenoopsutils_resource_name.disk will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "disk" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama-jmpbox"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_managed_disk"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_jumpbox_virtual_machine.data.azurenoopsutils_resource_name.nic will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nic" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama-jmpbox"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_interface"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_jumpbox_virtual_machine.data.azurenoopsutils_resource_name.nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama-jmpbox"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_jumpbox_virtual_machine.data.azurenoopsutils_resource_name.ppg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "ppg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama-jmpbox"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_proximity_placement_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_jumpbox_virtual_machine.data.azurenoopsutils_resource_name.pub_ip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "pub_ip" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama-jmpbox"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_public_ip"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_jumpbox_virtual_machine.data.azurenoopsutils_resource_name.secnic will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "secnic" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama-jmpbox"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_interface"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
          + "sec",
        ]
      + use_slug      = true
    }

  # module.mod_jumpbox_virtual_machine.data.azurenoopsutils_resource_name.vm_linux will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "vm_linux" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama-jmpbox"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_linux_virtual_machine"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_jumpbox_virtual_machine.data.azurenoopsutils_resource_name.vm_windows will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "vm_windows" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama-jmpbox"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_windows_virtual_machine"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_jumpbox_virtual_machine.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.data.azurerm_network_security_group.nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ampe-eus-panorama-jumpbox-prod-jumpbox-nsg"
      + resource_group_name = "ampe-eus-id-prod-rg"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.data.azurerm_resource_group.rgrp[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "rgrp" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "ampe-eus-id-prod-rg"
      + tags       = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.data.azurerm_subnet.snet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "snet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = (known after apply)
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ampe-eus-id-prod-default-snet"
      + network_security_group_id                      = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "ampe-eus-id-prod-rg"
      + route_table_id                                 = (known after apply)
      + service_endpoints                              = (known after apply)
      + virtual_network_name                           = "ampe-eus-id-prod-vnet"
    }

  # module.mod_jumpbox_virtual_machine.data.azurerm_virtual_network.vnet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "vnet" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "ampe-eus-id-prod-vnet"
      + resource_group_name     = "ampe-eus-id-prod-rg"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.azurerm_network_interface.nic[0] will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = []
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = (known after apply)
      + mac_address                   = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "ampe-eus-id-prod-rg"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig-vmnicipconfig1"
          + primary                                            = true
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.mod_jumpbox_virtual_machine.azurerm_network_interface_security_group_association.nsgassoc[0] will be created
  + resource "azurerm_network_interface_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.azurerm_virtual_machine_extension.omsagentwin[0] will be created
  + resource "azurerm_virtual_machine_extension" "omsagentwin" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "OmsAgentForWindows"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                    = <<-EOT
            {
                  "workspaceId": "f4a6b291-6836-4823-8dba-d73fa97701fa"
                }
        EOT
      + type                        = "MicrosoftMonitoringAgent"
      + type_handler_version        = "1.0"
      + virtual_machine_id          = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.azurerm_windows_virtual_machine.win_vm[0] will be created
  + resource "azurerm_windows_virtual_machine" "win_vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + enable_automatic_updates                               = false
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = false
      + id                                                     = (known after apply)
      + location                                               = (known after apply)
      + max_bid_price                                          = -1
      + name                                                   = (known after apply)
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ampe-eus-id-prod-rg"
      + size                                                   = "Standard_D4_v2"
      + tags                                                   = (known after apply)
      + virtual_machine_id                                     = (known after apply)

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }
    }

  # module.mod_panorama_virtual_machine.data.azurenoopsutils_resource_name.avset will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "avset" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_availability_set"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_panorama_virtual_machine.data.azurenoopsutils_resource_name.computer_windows will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "computer_windows" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "f332c83466"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_windows_virtual_machine"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_panorama_virtual_machine.data.azurenoopsutils_resource_name.disk will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "disk" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_managed_disk"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_panorama_virtual_machine.data.azurenoopsutils_resource_name.nic will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nic" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_interface"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_panorama_virtual_machine.data.azurenoopsutils_resource_name.nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_panorama_virtual_machine.data.azurenoopsutils_resource_name.ppg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "ppg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_proximity_placement_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_panorama_virtual_machine.data.azurenoopsutils_resource_name.pub_ip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "pub_ip" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_public_ip"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_panorama_virtual_machine.data.azurenoopsutils_resource_name.secnic will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "secnic" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_interface"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
          + "sec",
        ]
      + use_slug      = true
    }

  # module.mod_panorama_virtual_machine.data.azurenoopsutils_resource_name.vm_linux will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "vm_linux" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_linux_virtual_machine"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_panorama_virtual_machine.data.azurenoopsutils_resource_name.vm_windows will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "vm_windows" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "panorama"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_windows_virtual_machine"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_panorama_virtual_machine.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_panorama_virtual_machine.data.azurerm_network_security_group.nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ampe-eus-panorama-prod-nsg"
      + resource_group_name = "ampe-eus-id-prod-rg"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.mod_panorama_virtual_machine.data.azurerm_resource_group.rgrp[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "rgrp" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "ampe-eus-id-prod-rg"
      + tags       = (known after apply)
    }

  # module.mod_panorama_virtual_machine.data.azurerm_subnet.snet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "snet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = (known after apply)
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ampe-eus-id-prod-default-snet"
      + network_security_group_id                      = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "ampe-eus-id-prod-rg"
      + route_table_id                                 = (known after apply)
      + service_endpoints                              = (known after apply)
      + virtual_network_name                           = "ampe-eus-id-prod-vnet"
    }

  # module.mod_panorama_virtual_machine.data.azurerm_virtual_network.vnet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "vnet" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "ampe-eus-id-prod-vnet"
      + resource_group_name     = "ampe-eus-id-prod-rg"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.mod_panorama_virtual_machine.azurerm_linux_virtual_machine.linux_vm[0] will be created
  + resource "azurerm_linux_virtual_machine" "linux_vm" {
      + admin_username                                         = "azureadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = (known after apply)
      + max_bid_price                                          = -1
      + name                                                   = (known after apply)
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ampe-eus-id-prod-rg"
      + size                                                   = "Standard_D16ls_v5"
      + tags                                                   = (known after apply)
      + virtual_machine_id                                     = (known after apply)

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + plan {
          + name      = "byol"
          + product   = "panorama"
          + publisher = "paloaltonetworks"
        }

      + source_image_reference {
          + offer     = "panorama"
          + publisher = "paloaltonetworks"
          + sku       = "byol"
          + version   = "10.1.10"
        }
    }

  # module.mod_panorama_virtual_machine.azurerm_network_interface.nic[0] will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = []
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = (known after apply)
      + mac_address                   = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "ampe-eus-id-prod-rg"
      + tags                          = (known after apply)
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig-vmnicipconfig1"
          + primary                                            = true
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.mod_panorama_virtual_machine.azurerm_network_interface_security_group_association.nsgassoc[0] will be created
  + resource "azurerm_network_interface_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan for Palo Alto Panorama Add-on #31](https://github.com/AFMPE/mpe_palo_alto/actions/runs/7835193544)